# ReferencesNulled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..HostObjFailures..::..ReferencesNulled Property
BuiltInFailures..::..HostObjFailures Class See Also
---
One or more references are or have become invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ReferencesNulled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferencesNulled As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ReferencesNulled {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..HostObjFailures Class
Autodesk.Revit.DB Namespace